# PointIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointIterator Properties
PointIterator Class See Also
---
The PointIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current |
| CurrentObject |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace